package excel;

import org.apache.commons.lang.StringUtils;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by hzsunguanjun on 2017/6/7.
 */
public class ModifySettle {
    public static void main(String[] args) throws  Exception{
        String str = "YC17030159-20170428-2,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17040440-20170502-1,预付-货到付款,30,70,按发货批次分批付中间款,0,0,0,,严选,按预付款比例核销预付款\n" +
                "YC17040480-20170425-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17040418-20170419-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC16100572-20170606-2,预付-款到发货,90,10,全部到货后一次性付中间款,0,0,0,,严选,按100%核销预付款\n" +
                "YC16080364-20170331-1,预付-货到付款,30,70,按发货批次分批付中间款,0,0,0,,严选,按100%核销预付款\n" +
                "YC16070240-20170222-1,预付-款到发货,60,40,全部到货后一次性付中间款,0,0,0,,严选,按预付款比例核销预付款\n" +
                "YC17020117-20170406-57,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17020117-20170410-99,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17020117-20170417-86,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17030268-20170420-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17030334-20170411-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "yc17040373-20170420-1,预付-货到付款,30,70,按发货批次分批付中间款,0,0,0,,严选,按预付款比例核销预付款\n" +
                "YC17040424-20170407-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17040424-20170417-118,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17030241-20170412-3,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17030337-20170322-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17030242-20170418-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,,严选,按100%核销预付款\n" +
                "YC17030297-20170420-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030249-20170411-6,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC16060169-20161128-31,预付-货到付款,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC16070276-20170103-1,预付-货到付款,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC17040483-20170417-74,预付+月结-按采购入库单,0,0,,0,0,100,5号,严选,按100%核销预付款\n" +
                "YC17030248-20170420-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030220-20170417-99,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030272-20170412-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17010023-20170221-1,预付-款到发货,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC17020120-20170413-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17020052-20170223-6,预付-款到发货,40,50,全部到货后一次性付中间款,10,30,0,0,严选,按100%核销预付款\n" +
                "YC17030265-20170420-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC16060062-20170417-62,预付-款到发货,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC16060062-20170419-3,预付-款到发货,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC17030226-20170321-14,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030216-20170412-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030335-20170315-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030160-20170413-1,预付-货到付款,30,60,全部到货后一次性付中间款,0,60,0,0,严选,按100%核销预付款\n" +
                "YC17030160-20170417-91,预付-货到付款,30,60,全部到货后一次性付中间款,0,60,0,0,严选,按100%核销预付款\n" +
                "YC16080364-20170331-1,预付-货到付款,30,70,按发货批次分批付中间款,0,0,0,0,严选,按预付款比例核销预付款\n" +
                "YC16070240-20170301-5,预付-款到发货,60,40,全部到货后一次性付中间款,0,0,0,0,严选,按预付款比例核销预付款\n" +
                "YC17030334-20170411-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030337-20170322-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030249-20170411-6,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17030249-20170411-2 ,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17040468-20170509-3,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC17020052-20170217-19,预付-款到发货,40,50,全部到货后一次性付中间款,10,30,0,0,严选,按100%核销预付款\n" +
                "YC17020052-20170223-6,预付-款到发货,40,50,全部到货后一次性付中间款,10,30,0,0,严选,按100%核销预付款\n" +
                "YC17040480-20170425-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,60,0,0,严选,按100%核销预付款\n" +
                "YC16060062-20170419-3,预付-款到发货,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC16060062-20170417-62,预付-款到发货,30,70,全部到货后一次性付中间款,0,0,0,0,严选,按100%核销预付款\n" +
                "YC17010031-20170123-1,预付-货到付款,30,60,全部到货后一次性付中间款,10,45,0,0,严选,按100%核销预付款";


        //1:预付-货到付款,2:预付-款到发货,3:预付+月结-按采购入库单,4:预付+月结-按销售出库单
        Map<String, String> settleMap = new HashMap<>();
        settleMap.put("预付-货到付款","1");
        settleMap.put("预付-款到发货","2");
        settleMap.put("预付+月结-按采购入库单","3");
        settleMap.put("预付+月结-按销售出库单","4");
        settleMap.put("NULL", "");

        //中间款支付方式(1:按发货批次分批付尾款,2:全部到货后一次性付尾款)
        Map<String, String> midPayMap = new HashMap<>();
        midPayMap.put("按发货批次分批付中间款","1");
        midPayMap.put("全部到货后一次性付中间款","2");
        midPayMap.put("NULL", "");

        //核销方式（0:按预付款比例核销预付款，1:按100%核销预付款）
        Map<String, String> verifiedMap = new HashMap<>();
        verifiedMap.put("按预付款比例核销预付款","0");
        verifiedMap.put("按100%核销预付款","1");
        verifiedMap.put("NULL", "");

        String[] lines = str.split("\\n");
        String[] words;
        String settleMode;
        String midPayMode;
        String advancePayRate;
        String midPayRate;
        String midAdvancePayRate;
        String finalPayRate;
        String finalPayDetain;
        String monthPayRate;
        String verificationMode;
        String settlementDate;

        for (String line : lines){
            words = line.split(",");
            settleMode = settleMap.get(words[1]);
            midPayMode = midPayMap.get(words[4]);
            advancePayRate = words[2];
            switch (settleMode){
                case "1":
                    midPayRate = words[3];
                    midAdvancePayRate = "0";
                    monthPayRate = "0";
                    break;
                case "2":
                    midPayRate = "0";
                    midAdvancePayRate = words[3];
                    monthPayRate = "0";
                    break;
                case "3":
                case "4":
                    midPayRate = "0";
                    midAdvancePayRate = "0";
                    monthPayRate = words[7];
                    break;
                default:
                    monthPayRate = "0";
                    midPayRate = "0";
                    midAdvancePayRate = "0";
                    throw new Exception("xxx");
            }

            finalPayRate = words[5];
            finalPayDetain = words[6];
            settlementDate = StringUtils.isBlank(words[8]) ? "0" : words[8];
            verificationMode = verifiedMap.get(words[10]);
            System.out.println(String.format("update TB_YX_PMS_PURCHASE SET settleMode=%s, midPayMode=%s, advancePayRate=%s," +
                "midPayRate=%s,midAdvancePayRate=%s,finalPayRate=%s,finalPayDetain=%s,monthPayRate=%s,verificationMode=%s, settlementDate=%s where purchaseOrder=%s;",
             settleMode, midPayMode, advancePayRate, midPayRate, midAdvancePayRate, finalPayRate, finalPayDetain, monthPayRate, verificationMode,
                    settlementDate, "'"+words[0]+"'"));
        }

        System.out.println(String.format("sdsfafs,%s","sds"));
    }
}
